app/views/kopis/index.html.erb

SELECT "customers".* FROM "customers" INNER JOIN "customers_kopis" ON "customers"."id" = "customers_kopis"."customer_id" WHERE "customers_kopis"."kopi_id" = $1  [["kopi_id", 7]]
---
  <p><%= link_to kopi.name , "/kopis/" + kopi.id.to_s %> </p>
  <p>Owned by: <strong><%= kopi.customers.length %></strong> </p>