coffee_tracker/app/views/origins/show.html.erb

<ul>
<% @origin.kopi.each do |kopi| %>
---
SELECT "kopis".* FROM "kopis" WHERE "kopis"."origin_id" = $1  [["origin_id", 1]]