kopi-tracker/app/controllers/customers_controller.rb

  def index
    order = request.query_parameters[:order]
    puts order
    @customers = Customer.all
    if order == "asc"
      @customers = @customers.sort_by{ |customer| customer.kopis.length }
    elsif order == "desc"
      @customers = @customers.sort_by{ |customer| -customer.kopis.length }
---
SELECT "customers".* FROM "customers"
SELECT "kopis".* FROM "kopis" INNER JOIN "customers_kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" WHERE "customers_kopis"."customer_id" = $1  [["customer_id", 1]]
SELECT "kopis".* FROM "kopis" WHERE 1=0

  def new
   @kopis = Kopi.all
---
SELECT "kopis".* FROM "kopis"

  def edit
    @customer = Customer.find(params[:id])
    @kopis = Kopi.all
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis"

  def create
    @customer = Customer.new(customer_params)
    # @customer.user = current_user
    @customer.save
---
INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Moses"], ["created_at", "2020-05-13 09:09:28.090310"], ["updated_at", "2020-05-13 09:09:28.090310"]]

  def update
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]