kopi-tracker/app/controllers/farms_controller.rb

SELECT "farms".* FROM "farms"
---
  def index
    @farms = Farm.all

INSERT INTO "farms" ("name", "location", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "MacDonald's"], ["location", "Your Heart"], ["phone", 1284781], ["created_at", "2020-05-11 10:05:57.869815"], ["updated_at", "2020-05-11 10:05:57.869815"]]
---
  def create
    @farm = Farm.new(farm_params)
    @farm.save

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @farm = Farm.find(params[:id])

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def update
    @farm = Farm.find(params[:id])

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "farms" WHERE "farms"."id" = $1  [["id", 3]]
---
  def destroy
    @farm = Farm.find(params[:id])
    @farm.destroy