kopi-tracker/app/controllers/kopis_controller.rb

SELECT "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def index
    # test to see if we are at /origins/:id/kopis or /kopis
    if params.has_key?(:origin_id)
      # get all the kopis for a specific origin
      @kopis = Kopi.where(origin_id: params[:origin_id] )
      @origins = Origin.find(params[:origin_id] )
    else
      # get all kopis
      @kopis = Kopi.all