kopi-tracker/app/controllers/kopis_controller.rb

SELECT "kopis".* FROM "kopis"
---
  def index
    @kopi = Kopi.all

SELECT "origins".* FROM "origins"
SELECT "roasts".* FROM "roasts"
---
  def new
    @origins = Origin.all
    @roasts = Roast.all

INSERT INTO "kopis" ("name", "roast_id", "origin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Peaberry Beans"], ["roast_id", 8], ["origin_id", 14], ["created_at", "2019-11-06 02:01:50.472217"], ["updated_at", "2019-11-06 02:01:50.472217"]]
---
  def create
    @kopi = Kopi.new(kopi_params)
    @kopi.save

SELECT "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def show
    @kopi = Kopi.find(params[:id])

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "origins".* FROM "origins"
SELECT "roasts".* FROM "roasts"
---
  def edit
    @kopi = Kopi.find(params[:id])
    @origins = Origin.all
    @roasts = Roast.all

SELECT "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    @kopi = Kopi.find(params[:id])

SELECT "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "kopis" WHERE "kopis"."id" = $1  [["id", 2]]
---
  def destroy
    @kopi = Kopi.find(params[:id])
    @kopi.destroy