kopi-tracker/app/controllers/origins_controller.rb

SELECT "origins".* FROM "origins"
---
  def index
    @origin = Origin.all

INSERT INTO "origins" ("location", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location", "Test Location 1"], ["phone", "90191103"], ["created_at", "2019-11-07 09:14:50.123845"], ["updated_at", "2019-11-07 09:14:50.123845"]]
---
  def create
    @origin = Origin.new(origin_params)
    @origin.save

SELECT "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @origin = Origin.find(params[:id])

SELECT "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def edit
    @origin = Origin.find(params[:id])

SELECT "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "origins" SET "location" = $1, "phone" = $2, "updated_at" = $3 WHERE "origins"."id" = $4  [["location", "Test Location 11"], ["phone", "901911031"], ["updated_at", "2019-11-08 01:28:30.311418"], ["id", 2]]
---
  def update
    @origin = Origin.find(params[:id])
    @origin.update(origin_params)

SELECT "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "origins" WHERE "origins"."id" = $1  [["id", 12]]
---
  def destroy
    @origin = Origin.find(params[:id])
    @origin.destroy