kopi-tracker/app/controllers/roasts_controller.rb

SELECT "roasts".* FROM "roasts"
---
  def index
    @roasts = Roast.all

SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis" WHERE "kopis"."roast_id" = $1  [["roast_id", 1]]
---
  def show
    @roast = Roast.find(params[:id])
    @kopis = Kopi.where(roast_id: params[:id])

INSERT INTO "roasts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Roast Your Mother"], ["created_at", "2020-05-13 10:02:47.627573"], ["updated_at", "2020-05-13 10:02:47.627573"]]
---
  def create
    if !current_user.admin?
      redirect_to new_roast_path, notice: "Administrative access required to add new roast."
    else
      @roast = Roast.new(roast_params)
      # @farm.user = current_user
      @roast.save