kopi-tracker/app/views/farms/index.html.erb

      <td>
        <% @kopis = Kopi.where(farm_id: farm.id) %>
---
SELECT "kopis".* FROM "kopis" WHERE "kopis"."farm_id" = $1  [["farm_id", 1]]

        <% if farm.user_id.is_a? Integer %>
          <% @user = User.find(farm.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]