kopi-tracker/app/views/farms/show.html.erb

SELECT "kopis".* FROM "kopis" WHERE "kopis"."farm_id" = $1  [["farm_id", 1]]
---
  <ul>
  <% @farm.kopi.each do |kopi| %>