part_3_assignment/app/controllers/customers_controller.rb

  def new
    @kopis = Kopi.all
---
SELECT "kopis".* FROM "kopis"

  def create
    @customer = Customer.new(customer_params)

    @customer.save
---
INSERT INTO "customers" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Keith"], ["created_at", "2019-08-15 11:03:01.657856"], ["updated_at", "2019-08-15 11:03:01.657856"]]

  def edit
  @customer = Customer.find(params[:id])
  @kopis = Kopi.all
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis"

  def update
  @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]