part_3_assignment/app/controllers/kopis_controller.rb

  def index
    @kopis = Kopi.all
---
SELECT "kopis".* FROM "kopis"