kopi/app/controllers/cups_controller.rb

SELECT  "cups".* FROM "cups" WHERE "cups"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cup = Cup.find(params[:id])