kopi/app/controllers/customers_controller.rb

  def index
    @cups = Cup.all
    @customers = Customer.all
---
SELECT "customers".* FROM "customers"

  def new
    @cups = Cup.all
---
SELECT "cups".* FROM "cups"

  def create
    @customer = Customer.new(customer_params)
    @customer.save
---
INSERT INTO "cups_customers" ("cup_id", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cup_id", 2], ["customer_id", 3], ["created_at", "2019-01-29 10:26:08.397235"], ["updated_at", "2019-01-29 10:26:08.397235"]]
INSERT INTO "customers" ("name", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ronnie"], ["phone", 9099], ["created_at", "2019-01-29 10:26:08.395227"], ["updated_at", "2019-01-29 10:26:08.395227"]]