kopi/app/views/customers/show.html.erb

	<ul>
  <% @customer.cups.each do |cup| %>
---
SELECT "cups".* FROM "cups" INNER JOIN "cups_customers" ON "cups"."id" = "cups_customers"."cup_id" WHERE "cups_customers"."customer_id" = $1  [["customer_id", 1]]