jitpuay/app/controllers/farms_controller.rb

  def index
    @farms = Farm.all
---
SELECT "farms".* FROM "farms"

  def create
    @farm = Farm.new(farm_params)

    @farm.user = current_user

    if @farm.save
---
INSERT INTO "farms" ("location", "phone_number", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location", "mars"], ["phone_number", "10001001"], ["created_at", "2019-08-15 20:35:34.722794"], ["updated_at", "2019-08-15 20:35:34.722794"], ["user_id", 1]]

  def show
    @farm = Farm.find(params[:id])
---
SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def destroy
    @farm = Farm.find(params[:id])
    @farm.destroy
---
SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "farms" WHERE "farms"."id" = $1  [["id", 6]]