jitpuay/app/controllers/kopis_controller.rb

SELECT "kopis".* FROM "kopis"
---
  def index
    @kopis = Kopi.all

SELECT "farms".* FROM "farms"
---
  def new
    @farms = Farm.all

INSERT INTO "kopis" ("name", "roast", "farm_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "stirfry"], ["roast", "Italian"], ["farm_id", 2], ["created_at", "2019-08-15 16:05:26.609071"], ["updated_at", "2019-08-15 16:05:26.609071"]]
---
  def create
  @kopi = Kopi.new(kopi_params)

  @kopi.user = current_user

  if @kopi.save

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # deal with the case that we are trying to get a kopi for a farm that doesn't exist

    @kopi = Kopi.find(params[:id])

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "kopis" WHERE "kopis"."id" = $1  [["id", 9]]
---
  def destroy
    @kopi = Kopi.find(params[:id])
    @kopi.destroy