kopi/app/views/cups/show.html.erb

SELECT "customers".* FROM "customers" INNER JOIN "cups_customers" ON "customers"."id" = "cups_customers"."customer_id" WHERE "cups_customers"."cup_id" = $1  [["cup_id", 1]]
---
	<ul>
  <% @cup.customers.each do |customer| %>