coffee_tracker/app/views/customers/show.html.erb

SELECT "kopis".* FROM "kopis" INNER JOIN "customers_kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" WHERE "customers_kopis"."customer_id" = $1  [["customer_id", 2]]
---
<br>
	<% @customer.kopis.each do |kopi| %>