kopi-tracker/app/views/kopis/index.html.erb

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <td>
        <% @farm = Farm.find(kopi.farm_id) %>

SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      <td>
        <% @roast = Roast.find(kopi.roast_id) %>

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        <% if kopi.user_id.is_a? Integer %>
        <% @user = User.find(kopi.user_id) %>