kopilist/app/controllers/customers_controller.rb

  def index
    @customers = Customer.all
    puts "fjdkljflkjfkjljh hhlhlhflhflhfklhflkh"
    puts @customers
    #@combines = Customer.joins(:customers_kopis).select("*")
    @combines = Customer.joins(:customers_kopis).select("*").group("customer_id").count("kopi_id")
p @combines

@tests = @combines.to_a
@values= @tests.flatten
p @values
@values.select!.with_index{|_, i| i.odd?}
p @values
@arrayIndexes = @tests.flatten
@arrayIndexes.select!.with_index{|_, i| i.even?}
    sequence = request.query_parameters['sequence']
    type = request.query_parameters['type']

    case type
    when "kopiCount"
      puts("I am kopi")
      @customers = @customers.order("kopicount")
---
SELECT "customers".* FROM "customers"
SELECT COUNT(kopi_id) AS count_kopi_id, customer_id AS customer_id FROM "customers" INNER JOIN "customers_kopis" ON "customers_kopis"."customer_id" = "customers"."id" GROUP BY customer_id
SELECT "kopis".* FROM "kopis" INNER JOIN "customers_kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" WHERE "customers_kopis"."customer_id" = $1  [["customer_id", 1]]
SELECT "customers".* FROM "customers" ORDER BY kopis_count
SELECT "customers".* FROM "customers" ORDER BY kopicount

  def show
        # deal with the case that we are trying to get a ranger for a park that doesn't exist
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def new
    @kopis = Kopi.all
---
SELECT "kopis".* FROM "kopis"

  def edit
        @kopis = Kopi.all
        @customer = Customer.find(params[:id])
---
SELECT "kopis".* FROM "kopis"
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]

  def create
    puts "I am here I am here I am here"
    @customer = Customer.new(customer_params)
    puts @customer
    @customer.save
---
INSERT INTO "customers" ("customerName", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["customerName", "John"], ["created_at", "2020-05-13 09:28:48.151395"], ["updated_at", "2020-05-13 09:28:48.151395"]]

  def update
  @customer = Customer.find(params[:id])
puts "fjdlkjfldasjfkldasjflkadsjlfkdjasklfjwelqk;asdjfg;lkdsj"
puts customer_params[:kopi_ids].length
  @customer.update(customer_params)
  @customer.update(kopicount: customer_params[:kopi_ids].length-1)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "customers" SET "customerName" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["customerName", "hohoho"], ["updated_at", "2020-05-13 18:02:46.627166"], ["id", 9]]
UPDATE "customers" SET "updated_at" = $1, "kopicount" = $2 WHERE "customers"."id" = $3  [["updated_at", "2020-05-13 18:15:37.303013"], ["kopicount", "2.0"], ["id", 9]]

  def destroy
  @customer = Customer.find(params[:id])
  @customer.destroy
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 5]]