kopilist/app/controllers/customers_controller.rb

  def show
        # deal with the case that we are trying to get a ranger for a park that doesn't exist
    @customer = Customer.find(params[:id])
---
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    puts "I am here I am here I am here"
    @customer = Customer.new(customer_params)
    puts @customer
    @customer.save
---
INSERT INTO "customers" ("customerName", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["customerName", "Test"], ["created_at", "2020-05-13 14:10:31.418403"], ["updated_at", "2020-05-13 14:10:31.418403"]]

  def update
  @customer = Customer.find(params[:id])
puts "fjdlkjfldasjfkldasjflkadsjlfkdjasklfjwelqk;asdjfg;lkdsj"
  @customer.update(customer_params)
---
UPDATE "customers" SET "customerName" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["customerName", "Test2"], ["updated_at", "2020-05-13 14:11:18.163332"], ["id", 5]]

  def destroy
  @customer = Customer.find(params[:id])
  @customer.destroy
---
DELETE FROM "customers" WHERE "customers"."id" = $1  [["id", 5]]