kopilist/app/controllers/farms_controller.rb

SELECT "farms".* FROM "farms"
SELECT "kopis".* FROM "kopis"
SELECT "roasts".* FROM "roasts"
SELECT "orders".* FROM "orders"
---
  def index
    @farms = Farm.all
    @kopis = Kopi.all
    @roasts = Roast.all
    @orders = Order.all

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis" WHERE "kopis"."farm_id" = $1  [["farm_id", 2]]
---
  def show
    @farm = Farm.find(params[:id])
    @kopis = Kopi.where(farm_id: params[:id])

INSERT INTO "farms" ("location", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location", "chio2"], ["phone", "123.0"], ["created_at", "2020-05-12 09:27:04.436956"], ["updated_at", "2020-05-12 09:27:04.436956"]]
---
  def create
        @farm = Farm.new(farm_params)

    @farm.save

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def edit
    @farm = Farm.find(params[:id])

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "farms" SET "location" = $1, "updated_at" = $2 WHERE "farms"."id" = $3  [["location", "HohohoLand1"], ["updated_at", "2020-05-12 09:40:55.068946"], ["id", 4]]
---
  def update
      @farm = Farm.find(params[:id])

  @farm.update(farm_params)

SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "farms" WHERE "farms"."id" = $1  [["id", 5]]
---
  def destroy
      @farm = Farm.find(params[:id])
  @farm.destroy