kopilist/app/controllers/farms_controller.rb

SELECT "kopis".* FROM "kopis" ORDER BY customercount
---
  def index
    @farms = Farm.all
    @kopis = Kopi.all