kopilist/app/controllers/kopis_controller.rb

  def show
        # deal with the case that we are trying to get a ranger for a park that doesn't exist

    @kopi = Kopi.find(params[:id])

    if params[:farm_id].to_i != @kopi.farm.id
      # do something
      @farm = Farm.find(@kopi.farm.id)
    end

    if params[:roast_id].to_i != @kopi.roast.id
      # do something
      @roast = Roast.find(@kopi.roast.id)
---
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 22], ["LIMIT", 1]]
SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "farms".* FROM "farms" WHERE "farms"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def new
    @farms = Farm.all
    @roasts = Roast.all
    @customers = Customer.all
---
SELECT "farms".* FROM "farms"
SELECT "roasts".* FROM "roasts"
SELECT "customers".* FROM "customers"

  def edit
     @farms = Farm.all
    @roasts = Roast.all
    @customers = Customer.all
    @kopi = Kopi.find(params[:id])
---
SELECT "farms".* FROM "farms"
SELECT "roasts".* FROM "roasts"
SELECT "customers".* FROM "customers" WHERE 1=0
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]

  def create
    @kopi = Kopi.new(kopi_params)
    @kopi.user = current_user
    @kopi.save
---
INSERT INTO "kopis" ("name", "origin", "farm_id", "created_at", "updated_at", "roast_id", "price", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update

          @kopi = Kopi.find(params[:id])
puts "fjdlkjfldasjfkldasjflkadsjlfkdjasklfjwelqk;asdjfg;lkdsj"
  @kopi.update(kopi_params)
  @kopi.update(customercount: kopi_params[:customer_ids].length-1)
---
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 31], ["LIMIT", 1]]
UPDATE "kopis" SET "name" = $1, "updated_at" = $2 WHERE "kopis"."id" = $3  [["name", "3a3"], ["updated_at", "2020-05-12 13:13:49.902818"], ["id", 27]]
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
UPDATE "kopis" SET "updated_at" = $1, "customercount" = $2 WHERE "kopis"."id" = $3  [["updated_at", "2020-05-13 18:24:45.149874"], ["customercount", "3.0"], ["id", 26]]

  def destroy

          @kopi = Kopi.find(params[:id])
  @kopi.destroy
---
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
DELETE FROM "kopis" WHERE "kopis"."id" = $1  [["id", 20]]