kopilist/app/controllers/orders_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])
    @kopi = Kopi.find(@order.kopi_id)
    @user = User.find(@order.user_id)