kopilist/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
---
  def index
    @orders = Order.where(user_id: current_user.id)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def show
        # deal with the case that we are trying to get a ranger for a park that doesn't exist
            @order = Order.find(params[:id])

    if params[:kopi_id].to_i != @order.kopi.id
      # do something
      @kopi = Kopi.find(@order.kopi.id)

SELECT "kopis".* FROM "kopis"
---
  def new

    @kopis = Kopi.all

SELECT "kopis".* FROM "kopis"
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
  def edit
    @kopis = Kopi.all
    @order = Order.find(params[:id])

INSERT INTO "orders" ("pound", "kopi_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["pound", "21.0"], ["kopi_id", 12], ["created_at", "2020-05-12 10:50:09.046893"], ["updated_at", "2020-05-12 10:50:09.046893"], ["user_id", 2]]
---
  def create
    @order = Order.new(order_params)
    @order.user = current_user
    @order.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
UPDATE "orders" SET "pound" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["pound", "31.0"], ["updated_at", "2020-05-12 13:15:00.790556"], ["id", 45]]
---
  def update
          @order = Order.find(params[:id])

  @order.update(order_params)