kopilist/app/controllers/reports_controller.rb

  def index

    @combines=Kopi.joins(:order).select("*")
    @sum = @combines.sum(:price)
    @sale = @combines.count(:all)
    @totalEarning= @combines.map {|combine| combine.pound*combine.price}.sum
    puts @totalEarning
    @orders = Order.all
    puts @orders.ids[0]
    @kopis = Kopi.where(id: @orders.ids)
    puts @kopis

       puts request.query_parameters
    sequence = request.query_parameters['sequence']
    type = request.query_parameters['type']
    case type
    when "date"
      puts("I am date")
      @combines = @combines.order(:created_at)
      if sequence == "desc"
        @combines = @combines.reverse
      end

    when "kopi"
      puts("I am kopi")
      @combines = @combines.order(:name)
---
SELECT * FROM "kopis" INNER JOIN "orders" ON "orders"."kopi_id" = "kopis"."id" ORDER BY "kopis"."created_at" ASC
SELECT "kopis".* FROM "kopis" WHERE "kopis"."order_id" IN ($1, $2)  [["order_id", 1], ["order_id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."kopi_id" IN ($1, $2, $3, $4)  [["kopi_id", 12], ["kopi_id", 13], ["kopi_id", 14], ["kopi_id", 15]]
SELECT SUM("kopis"."price") FROM "kopis" LEFT OUTER JOIN "orders" ON "orders"."kopi_id" = "kopis"."id"
SELECT COUNT(*) FROM "kopis" INNER JOIN "orders" ON "orders"."kopi_id" = "kopis"."id"
SELECT * FROM "kopis" INNER JOIN "orders" ON "orders"."kopi_id" = "kopis"."id"
SELECT "orders"."id" FROM "orders"
SELECT "kopis".* FROM "kopis" WHERE "kopis"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
SELECT * FROM "kopis" INNER JOIN "orders" ON "orders"."kopi_id" = "kopis"."id" ORDER BY "kopis"."name" ASC