kopilist/app/controllers/rights_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
        # deal with the case that we are trying to get a ranger for a park that doesn't exist
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", true], ["updated_at", "2020-05-12 14:15:36.750387"], ["id", 1]]
---
  def update
      @user = User.find(params[:id])

  @user.update(admin: !@user.admin)