kopilist/app/controllers/roasts_controller.rb

  def show
    @roast = Roast.find(params[:id])
    @kopis = Kopi.where(roast_id: params[:id])
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis" WHERE "kopis"."roast_id" = $1  [["roast_id", 1]]

  def edit
       @roast = Roast.find(params[:id])
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

  def create
    @roast = Roast.new(roast_params)

    @roast.save
---
INSERT INTO "roasts" ("roast_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["roast_name", "To be deleted"], ["created_at", "2020-05-12 08:22:03.203730"], ["updated_at", "2020-05-12 08:22:03.203730"]]

  def update
         @roast = Roast.find(params[:id])

  @roast.update(roast_params)
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "roasts" SET "roast_name" = $1, "updated_at" = $2 WHERE "roasts"."id" = $3  [["roast_name", "To be deleted sure"], ["updated_at", "2020-05-12 08:26:31.064134"], ["id", 8]]

  def destroy
          @roast = Roast.find(params[:id])
  @roast.destroy
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "roasts" WHERE "roasts"."id" = $1  [["id", 8]]