app/views/customers/index.html.erb

SELECT "kopis".* FROM "kopis" INNER JOIN "customers_kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" WHERE "customers_kopis"."customer_id" = $1  [["customer_id", 2]]
---
              <td><%= link_to customer.name, customer_path(customer) %> </td>
              <td><%= customer.kopis.count %> </td>