app/views/orders/index.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
---
  <% grandtotal = 0%>
    <% @user.order.each do |order| %>