kopilist/app/views/kopis/show.html.erb

SELECT "customers".* FROM "customers" INNER JOIN "customers_kopis" ON "customers"."id" = "customers_kopis"."customer_id" WHERE "customers_kopis"."kopi_id" = $1  [["kopi_id", 25]]
---
<p>Shops selling</p>
<% @kopi.customers.each do |customer| %>