coffee_tracker/app/views/roasts/show.html.erb

SELECT "kopis".* FROM "kopis" WHERE "kopis"."roast_id" = $1  [["roast_id", 4]]
---

<% if @roasts.kopi.length == 0%>