app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 ORDER BY "customers"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_customer
      @customer = Customer.find(params[:id])