app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" LEFT OUTER JOIN "customers_kopis" ON "customers_kopis"."customer_id" = "customers"."id" LEFT OUTER JOIN "kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" GROUP BY "customers"."id" ORDER BY count(kopis.id) desc LIMIT $1  [["LIMIT", 10]]
SELECT "kopis".* FROM "kopis" INNER JOIN "customers_kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" WHERE "customers_kopis"."customer_id" = $1  [["customer_id", 2]]
SELECT "customers".* FROM "customers"
---
  def index
    sort_by = params[:sort]
    if sort_by == "asc"
      @customers = Customer.left_joins(:kopis).group(:id).order("count(kopis.id) asc").limit(10)
    elsif sort_by == "desc"
      @customers = Customer.left_joins(:kopis).group(:id).order("count(kopis.id) desc").limit(10)
    else
      @customers = Customer.all