app/controllers/kopis_controller.rb

  def create
    @kopi = Kopi.new(post_params)

    @kopi.save
---
INSERT INTO "kopis" ("name", "origin_id", "roast_id", "created_at", "updated_at", "price", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Newest Coffee"], ["origin_id", 15], ["roast_id", 6], ["created_at", "2020-02-13 01:57:09.074895"], ["updated_at", "2020-02-13 01:57:09.074895"], ["price", 200], ["user_id", 1]]