app/controllers/kopis_controller.rb

SELECT  "kopis".* FROM "kopis" LEFT OUTER JOIN "customers_kopis" ON "customers_kopis"."kopi_id" = "kopis"."id" LEFT OUTER JOIN "customers" ON "customers"."id" = "customers_kopis"."customer_id" GROUP BY "kopis"."id" ORDER BY count(customers.id) desc LIMIT $1  [["LIMIT", 10]]
SELECT "customers".* FROM "customers" INNER JOIN "customers_kopis" ON "customers"."id" = "customers_kopis"."customer_id" WHERE "customers_kopis"."kopi_id" = $1  [["kopi_id", 9]]
SELECT  "kopis".* FROM "kopis" LIMIT $1  [["LIMIT", 11]]
---
  def index
    sort_by = params[:sort]
    if sort_by == "asc"
      @kopis = Kopi.left_joins(:customers).group(:id).order("count(customers.id) asc").limit(10)
    elsif sort_by == "desc"
      @kopis = Kopi.left_joins(:customers).group(:id).order("count(customers.id) desc").limit(10)
    else
      @kopis = Kopi.all

SELECT  "kopis".* FROM "kopis" ORDER BY "kopis"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "roasts".* FROM "roasts"
SELECT "origins".* FROM "origins"
---
  def new
    @kopis = Kopi.all
    @roasts = Roast.all
    @origins = Origin.all

INSERT INTO "kopis" ("name", "origin_id", "roast_id", "created_at", "updated_at", "price", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Wonder Coffee"], ["origin_id", 15], ["roast_id", 6], ["created_at", "2020-02-12 06:46:47.575942"], ["updated_at", "2020-02-12 06:46:47.575942"], ["price", 50], ["user_id", 1]]
SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 ORDER BY "customers"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis" WHERE "kopis"."id" IN ($1, $2)  [["id", 7], ["id", 8]]
---
  def create
    if current_user
      @kopi = Kopi.new(kopi_params)
      @kopi.user = current_user
      puts @kopi.inspect
      puts @kopi.user
      @kopi.save
      redirect_to "/origins/" + @kopi.origin.id.to_s
    elsif current_customer
      @customer = Customer.find(current_customer.id)
      kopis = Kopi.where(id: customers_kopi_params["kopi_ids"] - [""])

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def show
    @kopi = Kopi.find(params[:id])