app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @orders = Order.all

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "kopis".* FROM "kopis"
---
  def new
    @orders = Order.all
    @kopis = Kopi.all

INSERT INTO "orders" ("weight", "kopi_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["weight", 2], ["kopi_id", 7], ["created_at", "2020-02-12 07:03:44.269956"], ["updated_at", "2020-02-12 07:03:44.269956"]]
---
  def create
    @order = Order.new(order_params)
    @order.save