app/controllers/origins_controller.rb

SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_origin
      @origin = Origin.find(params[:id])