app/controllers/origins_controller.rb

SELECT "origins".* FROM "origins"
---
    def index
        @origins = Origin.all

INSERT INTO "origins" ("location", "phone_number", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location", "Singapore"], ["phone_number", "92230101"], ["created_at", "2020-02-11 09:40:07.191565"], ["updated_at", "2020-02-11 09:40:07.191565"]]
---
    def create
        @origin = Origin.new(origin_params)

        @origin.save

SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @origin = Origin.find(params[:id])

SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
        @origin = Origin.find(params[:id])

SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def destroy
        @origin = Origin.find(params[:id])