app/controllers/reports_controller.rb

  def index
    @kopis = Kopi.all
    @origins = Origin.all

    # @ordersToday = Order.where("DATE(created_at) = ?", Date.today)
    @orders_today = Order.where(created_at: Time.zone.now.beginning_of_day..Time.zone.now.end_of_day)
    @total_orders = @orders_today.count
    @total_sales = @orders_today.sum{|order| order[:weight] }
---
SELECT "orders".* FROM "orders" WHERE "orders"."created_at" BETWEEN $1 AND $2  [["created_at", "2020-02-11 00:00:00"], ["created_at", "2020-02-11 23:59:59.999999"]]
SELECT "orders".* FROM "orders"

  def kopi
    @kopi = Kopi.find(params[:kopi_id])
---
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]