app/controllers/roasts_controller.rb

  def index
    @roasts = Roast.all
---
SELECT "roasts".* FROM "roasts"

  def show
    @roast = Roast.find(params[:id])
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def edit
    #this is like the select * from roast model
    @roast = Roast.find(params[:id])
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    # render plain: params[:roast].inspect

    #this is the link to the models roast
    @roast = Roast.new(roast_params)

    @roast.save
---
INSERT INTO "roasts" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "American"], ["created_at", "2020-02-12 10:56:51.360666"], ["updated_at", "2020-02-12 10:56:51.360666"]]

  def update
    @roast = Roast.find(params[:id])

    @roast.update(roast_params)
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "roasts" SET "name" = $1, "updated_at" = $2 WHERE "roasts"."id" = $3  [["name", "Cinnamon"], ["updated_at", "2020-02-13 01:43:28.108782"], ["id", 3]]

  def destroy
    @roast = Roast.find(params[:id])
---
SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]