coffee_tracker/app/views/kopis/show.html.erb

SELECT "customers".* FROM "customers" INNER JOIN "customers_kopis" ON "customers"."id" = "customers_kopis"."customer_id" WHERE "customers_kopis"."kopi_id" = $1  [["kopi_id", 2]]
---
<p>Customers who like this kopi: </p>
<% @kopi.customers.each do |customer| %>