coffee_tracker/app/views/kopis/show.html.erb

SELECT  1 AS one FROM "kopis" INNER JOIN "customers_kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" WHERE "customers_kopis"."customer_id" = $1 AND "kopis"."id" = $2 LIMIT $3  [["customer_id", 1], ["id", 2], ["LIMIT", 1]]
---
	<h3>Logged in as: <%= name.capitalize %></h3>
	<% if current_customer.kopis.exists?(@kopi.id) %>

SELECT "customers".* FROM "customers" INNER JOIN "customers_kopis" ON "customers"."id" = "customers_kopis"."customer_id" WHERE "customers_kopis"."kopi_id" = $1  [["kopi_id", 2]]
---
<p>Customers who like this kopi: </p>
<% @kopi.customers.each do |customer| %>