coffee_tracker/app/controllers/customers_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  1 AS one FROM "kopis" INNER JOIN "customers_kopis" ON "kopis"."id" = "customers_kopis"."kopi_id" WHERE "customers_kopis"."customer_id" = $1 AND "kopis"."id" = $2 LIMIT $3  [["customer_id", 1], ["id", 2], ["LIMIT", 1]]
---
  def customer_kopi
    @customer = Customer.find(params[:customer_id]);
    @kopi = Kopi.find(params[:id]);
    if @customer.kopis.exists?(@kopi.id)