coffee_tracker/app/controllers/kopis_controller.rb

SELECT "kopis".* FROM "kopis" WHERE "kopis"."origin_id" = $1  [["origin_id", 1]]
SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "kopis".* FROM "kopis"
---
  def index
    # test to see if we are at /origins/:id/kopis or /kopis
    if params.has_key?(:origin_id)
      # get all the kopis for a specific origin
      @kopis = Kopi.where(origin_id: params[:origin_id] )
      @origins = Origin.find(params[:origin_id] )
    else
      # get all kopis
      @kopis = Kopi.all

SELECT "origins".* FROM "origins"
SELECT "roasts".* FROM "roasts"
---
  def new
    @origins = Origin.all
    @roasts = Roast.all

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "origins".* FROM "origins"
SELECT "roasts".* FROM "roasts"
---
  def edit
    @kopi = Kopi.find(params[:id])
    @origins = Origin.all
    @roasts = Roast.all

INSERT INTO "kopis" ("name", "roast_id", "origin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "teh halia"], ["roast_id", 3], ["origin_id", 3], ["created_at", "2019-08-14 07:42:58.194859"], ["updated_at", "2019-08-14 07:42:58.194859"]]
---
  def create

    @kopi = Kopi.new(kopi_params)
    @kopi.save

INSERT INTO "kopis" ("name", "roast_id", "origin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "SG Cinnamon"], ["roast_id", 1], ["origin_id", 1], ["created_at", "2019-08-17 16:42:15.343100"], ["updated_at", "2019-08-17 16:42:15.343100"]]
---
  def add
    @kopi = Kopi.new(kopi_params)
    @kopi.origin_id = params[:origin_id]
    @kopi.save

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # deal with the case that we are trying to get a kopi for a origin that doesn't exist

    @kopi = Kopi.find(params[:id])

SELECT  "kopis".* FROM "kopis" WHERE "kopis"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "kopis" SET "name" = $1, "updated_at" = $2 WHERE "kopis"."id" = $3  [["name", "white kopi"], ["updated_at", "2019-08-13 16:26:51.097698"], ["id", 1]]
---
 def update
    @kopi = Kopi.find(params[:id])

    @kopi.update(kopi_params)