coffee_tracker/app/controllers/origins_controller.rb

  def home
    @origins = Origin.all
    @kopis = Kopi.all
    @roasts = Roast.all
---
SELECT "origins".* FROM "origins"
SELECT "kopis".* FROM "kopis"
SELECT "roasts".* FROM "roasts"

  def index
    @origins = Origin.all
---
SELECT "origins".* FROM "origins"

  def create
    @origin = Origin.new(origin_params)

    @origin.save
---
INSERT INTO "origins" ("location", "phone") VALUES ($1, $2) RETURNING "id"  [["location", "Singapore"], ["phone", "9092 0123"]]

  def show
    @origin = Origin.find(params[:id])
---
SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def edit
    @origin = Origin.find(params[:id])
---
SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update


    @origin = Origin.find(params[:id])

    @origin.update(origin_params)
---
SELECT  "origins".* FROM "origins" WHERE "origins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "origins" SET "phone" = $1 WHERE "origins"."id" = $2  [["phone", "3333"], ["id", 3]]