coffee_tracker/app/controllers/concerns/roasts_controller.rb

SELECT  "roasts".* FROM "roasts" WHERE "roasts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @roasts = Roast.find(params[:id])